In [45]:
import psycopg2
from psycopg2 import sql

In [46]:
# Replace these parameters with your actual database credentials
db_user = "postgres"
db_password = "123456" #Use your own password
db_host = "localhost"  # Usually "localhost" if running locally
db_port = "5432"  # Default is 5432

connection = psycopg2.connect(
    user=db_user,
    password=db_password,
    host=db_host,
    port=db_port
)

In [47]:
cursor = connection.cursor()

In [48]:
connection.autocommit = True

q = sql.SQL('CREATE DATABASE pysql;')
cursor.execute(q)

cursor.close()
connection.close()

In [49]:
connection = psycopg2.connect(
    user=db_user,
    password=db_password,
    host=db_host,
    port=db_port,
    database="pysql"
)

cursor = connection.cursor()

q = sql.SQL('''CREATE TABLE IF NOT EXISTS students (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    age INTEGER,
    campus_id INTEGER,
    total_grade FLOAT
);''')

cursor.execute(q)
connection.commit()

In [50]:
data_values = [
    ('Rafif Iman', 20, 1, 85.5),
    ('Hana Arisona', 21, 2, 90.2),
    ('Raka Purnomo', 19, 1, 78.9),
    ('Danu Irfansyah', 20, 3, 92.7),
    ('Rachman Ardhi', 22, 2, 88.1)
    ]

insert_query = "INSERT INTO students (name, age, campus_id, total_grade) VALUES (%s,%s,%s,%s)"

cursor.executemany(insert_query, data_values)

connection.commit()

In [31]:
import pandas as pd

In [32]:
select_query = '''SELECT campus_id, MIN(age) AS min_age, MAX(age) AS max_age
                    FROM students
                    GROUP BY campus_id;'''
df = pd.read_sql_query(select_query, connection)

df

C:\Users\mhmdr\AppData\Local\Temp\ipykernel_7104\1729750494.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(select_query, connection)

   campus_id  min_age  max_age
0          3       20       20
1          2       21       22
2          1       19       20

In [58]:
import sqlalchemy
from sqlalchemy import create_engine,text

In [59]:
engine = create_engine("postgresql://postgres:123456@localhost/pysql")

In [60]:
query = 'select * FROM students'

In [61]:
df2 = pd.DataFrame(engine.connect().execute(text(query)))
df2

   id            name  age  campus_id  total_grade
0   1      Rafif Iman   20          1         85.5
1   2    Hana Arisona   21          2         90.2
2   3    Raka Purnomo   19          1         78.9
3   4  Danu Irfansyah   20          3         92.7
4   5   Rachman Ardhi   22          2         88.1

In [62]:
avg_grade_age = df2.groupby('campus_id')[['total_grade','age']].mean().reset_index()
avg_grade_age

   campus_id  total_grade   age
0          1        82.20  19.5
1          2        89.15  21.5
2          3        92.70  20.0

In [63]:
avg_grade_age.to_sql('avg_grade_age',engine,if_exists='replace',index=False)

3

 get info data type : SELECT * from INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME='avg_grade_age'

In [65]:
new_data = {
    'name' : 'budi',
    'age' : 17,
    'campus_id' : 1,
    'total_grade':75.5,
    
}

In [68]:
new_data = pd.DataFrame(new_data,index=[0])

In [69]:
new_data.to_sql('students',engine,if_exists='append',index=False)

1

In [70]:
df2 = pd.DataFrame(engine.connect().execute(text(query)))
df2

   id            name  age  campus_id  total_grade
0   1      Rafif Iman   20          1         85.5
1   2    Hana Arisona   21          2         90.2
2   3    Raka Purnomo   19          1         78.9
3   4  Danu Irfansyah   20          3         92.7
4   5   Rachman Ardhi   22          2         88.1
5   6            budi   17          1         75.5

In [71]:
from sqlalchemy_utils import database_exists, create_database

In [72]:
engine = create_engine("postgresql://postgres:123456@localhost/pysql_duplicated")

In [73]:
if not database_exists(engine.url):
    create_database(engine.url)

print(database_exists(engine.url))

True

create table sql

In [79]:
from sqlalchemy import MetaData,Column,String,Integer,Table

In [78]:
metadata_obj = MetaData()

In [80]:
profile = Table( 
    'profile',                                         
    metadata_obj,                                     
    Column('email', String, primary_key=True),   
    Column('name', String),                     
    Column('contact', Integer),                 
)

In [81]:
metadata_obj.create_all(engine)